STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_DirectionFinding_Peripheral_Tag/STM32_WPAN/App/app_ble.c
          DF_TAGHandleNotification.EvtOpcode = DF_TAG_CONN_HANDLE_EVT;
          DF_TAGHandleNotification.ConnectionHandle = p_enhanced_conn_complete->Connection_Handle;
          DF_TAG_APP_EvtRx(&DF_TAGHandleNotification);
          /* USER CODE BEGIN HCI_EVT_LE_ENHANCED_CONN_COMPLETE */

          /* The connection is done, there is no need anymore to schedule the LP ADV */
          UTIL_TIMER_Stop(&(bleAppContext.Advertising_mgr_timer_Id));
          
          /* Once connected the LED2 is always on, on both devices Central and Peripheral. */
          APP_BSP_LED_On(LED_GREEN);
          
          /* Set the CTE transmit parameters */
          ret = hci_le_set_connection_cte_transmit_parameters(
              p_enhanced_conn_complete->Connection_Handle,          // Connection handle that identifies the connection
              CTE_TYPE_SUPPORT,           // Support for any CTE type
              TX_SWITCHING_PATTERN_LENGTH,// Length of the antenna switching pattern
              antenna_ids                 // List of antenna IDs in the pattern
          );

          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("Failed to set CTE parameters: reason=0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> hci_le_set_connection_cte_transmit_parameters : Success\n");
          }

          /* Enable the CTE response */
          ret = hci_le_connection_cte_response_enable(p_enhanced_conn_complete->Connection_Handle, ENABLE);

          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("Failed to enable CTE response: reason=0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> hci_le_connection_cte_response_enable : Success\n");
          }

          /* USER CODE END HCI_EVT_LE_ENHANCED_CONN_COMPLETE */
          break; /* HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
        {
          uint32_t conn_interval_us = 0;
          hci_le_connection_complete_event_rp0 *p_conn_complete;
          p_conn_complete = (hci_le_connection_complete_event_rp0 *) p_meta_evt->data;
          conn_interval_us = p_conn_complete->Conn_Interval * 1250;
          LOG_INFO_APP(">>== HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE - Connection handle: 0x%04X\n", p_conn_complete->Connection_Handle);
          LOG_INFO_APP("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      p_conn_complete->Peer_Address[5],
                      p_conn_complete->Peer_Address[4],
                      p_conn_complete->Peer_Address[3],
                      p_conn_complete->Peer_Address[2],
                      p_conn_complete->Peer_Address[1],
                      p_conn_complete->Peer_Address[0]);
          LOG_INFO_APP("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout:   %d ms\n     - Status:               0x%02X\n",
                      conn_interval_us / 1000,
                      (conn_interval_us%1000) / 10,
                      p_conn_complete->Conn_Latency,
                      p_conn_complete->Supervision_Timeout * 10,
                      p_conn_complete->Status
                     );
          UNUSED(conn_interval_us);

          if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
          {
            /* Connection as client */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
          }
          else
          {
            /* Connection as server */
            bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
          }
          bleAppContext.connectionHandle = p_conn_complete->Connection_Handle;

          DF_TAGHandleNotification.EvtOpcode = DF_TAG_CONN_HANDLE_EVT;
          DF_TAGHandleNotification.ConnectionHandle = p_conn_complete->Connection_Handle;
          DF_TAG_APP_EvtRx(&DF_TAGHandleNotification);
          /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
          /* The connection is done, there is no need anymore to schedule the LP ADV */
          UTIL_TIMER_Stop(&(bleAppContext.Advertising_mgr_timer_Id));

          /* Once connected the LED2 is always on, on both devices Central and Peripheral. */
          APP_BSP_LED_On(LED_GREEN);
          
          /* Set the CTE transmit parameters */
          ret = hci_le_set_connection_cte_transmit_parameters(
              p_conn_complete->Connection_Handle,          // Connection handle that identifies the connection
              CTE_TYPE_SUPPORT,           // Support for any CTE type
              TX_SWITCHING_PATTERN_LENGTH,// Length of the antenna switching pattern
              antenna_ids                 // List of antenna IDs in the pattern
          );

          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("Failed to set CTE parameters: reason=0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> hci_le_set_connection_cte_transmit_parameters : Success\n");
          }

          /* Enable the CTE response */
          ret = hci_le_connection_cte_response_enable(p_conn_complete->Connection_Handle, ENABLE);

          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("Failed to enable CTE response: reason=0x%02X\n", ret);
          }
          else
          {
            LOG_INFO_APP("==>> hci_le_connection_cte_response_enable : Success\n");
          }

          /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */
        }
        /* USER CODE BEGIN SUBEVENT */
        

        /* USER CODE END SUBEVENT */
        default:
        {
          LOG_DEBUG_BLE("SVCCTL_App_Notification: unhandled SUBEVENT with opcode: 0x%02X\n", p_meta_evt->subevent);
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
        }
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
    }
    break; /* HCI_LE_META_EVT_CODE */

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ECODE */

        /* USER CODE END ECODE */
        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
        {
          aci_l2cap_connection_update_resp_event_rp0 *p_l2cap_conn_update_resp;
          p_l2cap_conn_update_resp = (aci_l2cap_connection_update_resp_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_resp);
          /* USER CODE BEGIN EVT_L2CAP_CONNECTION_UPDATE_RESP */

